<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<meta name="Seite-topic" content="DatTools-Manual: FT4FP-Lizenz" />
<meta name="Description" content="DatTools-Manual: FT4FP-Lizenz" />
<meta name="Keywords" content="dat, tools, MakeDat, mehrsprachig" />
<meta name="date" content="2012-02-12T00:00:00+00:00" />
<meta name="robots" content="index,follow" />
<meta name="revisit-after" content="14 days" />
<meta name="generator" content="Bernhard Schornak, handwritten" />
<style type="text/css"><!--@import "../st.css";--></style>
<link rel="SHORTCUT ICON" href="./pics/favicon.ico" />
<title>FT4FP-Lizenz</title>
</head>
<body id="top">
<div class="pagehd">
<div id="menu">
<ul>
 <li><a href="0000.htm">Inhalt</a></li>
 <li><a href="0100.htm">DatTools</a></li>
 <li><a href="0200.htm">Auswahl</a></li>
 <li><a href="0300.htm">MakeDat 5</a></li>
 <li><a href="0400.htm">&Uuml;bersetzung</a></li>
 <li><a href="0500.htm">Standardfelder</a></li>
 <li><a href="../manual.htm">Heim</a></li>
</ul>
</div>
<div class="update">[2012-02-12]</div>
<div class="headpc"><img src="./pics/md5.png" alt="DatTools Logo" width="200" height="100" border="0" /></div>
</div>
<div class="crlf1"></div>
&#160;&#160;&#160;<a href="../manual.htm"><img src="./pics/nav_up.png" alt="aufw&auml;rts" width="20" height="20" border="0" title="aufw&auml;rts" /></a>
&#160;&#160;&#160;<a href="0000.htm"><img src="./pics/nav_bk.png" alt="zur&uuml;ck" width="20" height="20" border="0" title="zur&uuml;ck" /></a>
&#160;&#160;&#160;<a href="0100.htm"><img src="./pics/nav_fw.png" alt="vorw&auml;rts" width="20" height="20" border="0" title="vorw&auml;rts" /></a>
<div class="text100">
<h1>FT4FP-Lizenz</h1>
<h2>Pr&auml;ambel</h2>
Das FT4FP-Projekt dient dem Schutz der Rechte kreativer Menschen und stellt eine Plattform bereit, die das Teilen
 <i>geistigen Eigentums</i> mit allen interessierten Menschen rund um den Globus erm&ouml;glicht. Die FT4FP-Lizenz
 verbietet die profit-orientierte Ausbeutung <i>geistigen Eigentums</i>, das unter ihren Schutz gestellt wurde.
 <i>geistiges Eigentum</i> sollt niemals zu einer propriet&auml;ren Ware degradiert werden, die nur an jene
 verkauft wird, die &uuml;ber die n&ouml;tigen Zahlungsmittel verf&uuml;gen, sie zu <i>konsumieren</i>.
 <i>Wissen</i> und <i>Kunstwerke</i> sollten nicht in Tresore eingesperrt sein, die nur einer sehr kleinen Gruppe
 von Menschen freien Zugang gew&auml;hren.
<div class="crlf2"></div>
<h2>Die FT4FP-Lizenz</h2>
<div class="textpar"><b>1.0.</b>
 <i>Werk</i> steht f&uuml;r jede Form <i>geistigen Eigentums</i>, das durch internationale
 Urheberrechte gesch&uuml;tzt werden kann, zum Beispiel akademische Beobachtungen, Bilder, B&uuml;cher, Dokumente,
 Gedichte, Musik, Skulpturen, Software, technische Erfindungen, wissenschaftliche Entdeckungen und Erkenntnisse,
 et cetera.
</div><div class="crlf1"></div>
<div class="textpar"><b>1.1.</b>
 Mit der Nutzung des erhaltenen Werkes erkennen Sie den Ausschluss jedwelcher Garantien bez&uuml;glich seiner
 Funktion oder Benutzbarkeit an.
</div><div class="crlf1"></div>
<div class="textpar"><b>1.2.</b>
 Mit der Nutzung des erhaltenen Werkes erkennen Sie seinen anti-kommerziellen Charakter an und stimmen explizit
 zu, dass Alles, was Sie aus dem Werk ableiten, die Haupteigenschaft jedes unter dem Schutz dieser Lizenz stehenden
 Werkes erbt: Es muss frei verf&uuml;gbar und kostenfrei sein.
</div><div class="crlf2"></div>
<div class="textpar"><b>2.0.</b>
 Sobald Sie ein Werk unter den Schutz der FT4FP-Lizenz stellen, werden Sie automatisch zu einem Mitglied des <i>Free
 Thought For Free People</i> ("freies Denken f&uuml;r freie Menschen"), kurz<i>FT4FP</i>-Projekts.
</div><div class="crlf1"></div>
<div class="textpar"><b>2.1.</b>
 Diese virtuelle Mitgliedschaft verpflichtet Sie dazu, die Regeln dieser Lizenz anzuerkennen und einzuhalten, so
 lange Sie Ihr Werk unter ihren Schutz stellen.
</div><div class="crlf1"></div>
<div class="textpar"><b>2.2.</b>
 Da dies eine rein virtuelle Mitgliedschaft ist, ist sie kostenfrei und beinhaltet, ausser den hier genannten, keine
 weiteren Verpflichtungen.
</div><div class="crlf2"></div>
<div class="textpar"><b>3.0.</b>
 Jedes nach den Regeln der FT4FP-Lizenz ver&ouml;ffentlichte Werk muss frei verf&uuml;gbar und kostenfrei sein. Die
 Verf&uuml;gbarkeit ist jedoch auf die M&ouml;glichkeiten jedes Mitglieds beschr&auml;nkt - kein Mitglied ist
 verpflichtet, selbst Kopien bereitzustellen oder zu liefern.
</div><div class="crlf1"></div>
<div class="textpar"><b>3.1.</b>
 Es ist nicht erlaubt, Gruppen von Menschen selektiv vom Erhalt einer Kopie auszuschliessen.
</div><div class="crlf1"></div>
<div class="textpar"><b>3.2.</b>
 Kopien des Werks d&uuml;rfen beliebig oft reproduziert werden. Kopien von Kopien m&uuml;ssen, wie das Original,
 frei verf&uuml;gbar und kostenfrei sein.
</div><div class="crlf1"></div>
<div class="textpar"><b>3.3.</b>
 Legale Kopien des Werks sind kostenfrei.
</div><div class="crlf1"></div>
<div class="textpar"><b>3.4.</b>
 Das Zahlen eines Entgelts f&uuml;r eine Kopie des Werks ist illegal. Empf&auml;nger von Kopien d&uuml;rfen jedoch
 die f&uuml;r den Versand oder die Medien anfallenden Kosten erstatten.
</div><div class="crlf2"></div>
<div class="textpar"><b>4.0.</b>
 Unter den Schutz der FT4FP-Lizenz gestellte Werke sollten in nicht-propriet&auml;ren Formaten ver&ouml;ffentlicht
 werden. Propriet&auml;re Formate schliessen Menschen von der Benutzung Ihres Werkes aus. Das Format sollte offenen,
 von Hardware und Plattformen unabh&auml;ngigen Standards entsprechen, soweit das m&ouml;glich ist.
</div><div class="crlf2"></div>
<div class="textpar"><b>5.0.</b>
 Das Werk sowie seine Vervielf&auml;ltigungs- und Nutzungsrechte sind Eigentum des Autors - nur der Autor hat das
 Recht, Kopien des Werks zu verkaufen oder das Werk kommerziell auszubeuten.
</div><div class="crlf1"></div>
<div class="textpar"><b>5.1.</b>
 Die Verwendung des Werkes zu <i>kommerziellen Zwecken</i> ist ohne schriftlich erteilte Erlaubnis des Autors strikt
 verboten. Die Verwendung des Werkes in Firmen, die Verbreitung kostenfreier Kopien als Beilage kostenpflichtiger
 Produkte, die Ver&ouml;ffentlichung des Werkes &uuml;ber ganz oder teilweise werbefinanzierte Radio- oder
 TV-Stationen sowie die Ver&ouml;ffentlichung des Werkes &uuml;ber ganz oder teilweise werbefinanzierte
 Internetseiten (sofern die Domain Eigentum des Betreibers der Seite ist) werden als <i>kommerzielle Nutzung</i>
 gewertet.
</div><div class="crlf1"></div>
<div class="textpar"><b>5.2.</b>
 Sie m&uuml;ssen eine kommerzielle Nutzungslizenz erwerben, <i>bevor</i> Sie das Werk kommerziell nutzen d&uuml;rfen.
</div><div class="crlf2"></div>
<div class="textpar"><b>6.0.</b>
 Die Ver&ouml;ffentlichung von Modifikationen, Replikaten und Ableitungen aus dem Werk - auch in Teilen - ist ohne
 schriftliche Genehmigung des Autors unzul&auml;ssig. Modifikationen d&uuml;rfen vorgenommen werden, wenn der Autor
 Modifikationen in seinen Urheberrechtshinweisen ausdr&uuml;cklich erlaubt (in diesem Fall ist keine schriftliche
 Genehmigung erforderlich).
</div><div class="crlf1"></div>
<div class="textpar"><b>6.1.</b>
 Modifikationen von Werken und Ableitungen aus Werken, die nach den Regeln der FT4FP-Lizenz ver&ouml;ffentlicht
 wurden, <i>erben</i> alle Eigenschaften des Originals. Da <i>kostenfrei sein</i> die Haupteigenschaft aller Werke
 ist, die unter den Schutz dieser Lizenz gestellt werden, m&uuml;ssen alle Modifikationen und Ableitungen ebenfalls
 <i>kostenfrei</i> sein.
</div><div class="crlf2"></div>
<div class="textpar"><b>7.0.</b>
 Die Verbreitung des Werks in Ausz&uuml;gen ist ohne die schriftliche Genehmigung des Autors verboten - das Werk
 muss als Ganzes und "wie es ist" weitergegeben werden. Das Entfernen von Teilen oder das Hinzuf&uuml;gen fremder
 Inhalte ist nicht erlaubt.
</div><div class="crlf2"></div>
<div class="textpar"><b>8.0.</b>
 Das Werk wird kostenfrei und "wie es ist" zur Verf&uuml;gung gestellt.
</div><div class="crlf1"></div>
<div class="textpar"><b>8.1.</b>
 Das Werk erhebt keinen Anspruch, perfekt zu sein.
</div><div class="crlf1"></div>
<div class="textpar"><b>8.2.</b>
 Das Werk tut genau das, wof&uuml;r es der Autor geschaffen hat.
</div><div class="crlf1"></div>
<div class="textpar"><b>8.3.</b>
 Das Werk kann h&ouml;chstwahrscheinlich nicht f&uuml;r andere andere Zwecke genutzt werden.
</div><div class="crlf1"></div>
<div class="textpar"><b>8.4.</b>
 Das Vorhandensein zu einem spezifizierten Standard kompatibler technischer Ger&auml;te oder Plattformen mag zu
 seiner Benutzung erforderlich sein. Werden derartige Voraussetzungen nicht erf&uuml;llt, ist das Werk
 gegebenenfalls nicht verwendbar.
</div><div class="crlf2"></div>
<div class="textpar"><b>9.0.</b>
 Der Autor gew&auml;hrt keinerlei Garantie f&uuml;r die Benutzbarkeit oder Zuverl&auml;ssigkeit des Werks.
</div><div class="crlf1"></div>
<div class="textpar"><b>9.1.</b>
 Mit der Nutzung des Werkes erkennen Sie den Ausschluss jeglicher Garantie an.
</div><div class="crlf1"></div>
<div class="textpar"><b>9.2.</b>
 Der Autor schliesst jegliche Haftung f&uuml;r eventuell bei Benutzung des Werkes entstehende Sch&auml;den und
 Folgesch&auml;den aus. Der Benutzer erkennt mit der Benutzung des Werkes (siehe <b>9.1.</b>) den Ausschluss
 jeglicher Garantie an. Er &uuml;bernimmt daher f&uuml;r s&auml;mtliche Sch&auml;den, die sich auf die Benutzung
 des Werkes zur&uuml;ckf&uuml;hren lassen, selbst die volle Haftung.
</div></div><div class="crlf2"></div>
&#160;&#160;&#160;<a href="../manual.htm"><img src="./pics/nav_up.png" alt="aufw&auml;rts" width="20" height="20" border="0" title="aufw&auml;rts" /></a>
&#160;&#160;&#160;<a href="0000.htm"><img src="./pics/nav_bk.png" alt="zur&uuml;ck" width="20" height="20" border="0" title="zur&uuml;ck" /></a>
&#160;&#160;&#160;<a href="0100.htm"><img src="./pics/nav_fw.png" alt="vorw&auml;rts" width="20" height="20" border="0" title="vorw&auml;rts" /></a>
<div class="crlf1"></div>
</body>
</html>
