<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<meta name="Seite-topic" content="DatTools-Manual: DatTools" />
<meta name="Description" content="DatTools-Manual: DatTools" />
<meta name="Keywords" content="dat, tools, MakeDat, mehrsprachig" />
<meta name="date" content="2012-02-12T00:00:00+00:00" />
<meta name="robots" content="index,follow" />
<meta name="revisit-after" content="14 days" />
<meta name="generator" content="Bernhard Schornak, handwritten" />
<style type="text/css"><!--@import "../st.css";--></style>
<link rel="SHORTCUT ICON" href="./pics/favicon.ico" />
<title>DatTools</title>
</head>
<body id="top">
<div class="pagehd">
<div id="menu">
<ul>
 <li><a href="0000.htm">Inhalt</a></li>
 <li>DatTools</li>
 <li><a href="0200.htm">Auswahl</a></li>
 <li><a href="0300.htm">MakeDat 5</a></li>
 <li><a href="0400.htm">&Uuml;bersetzung</a></li>
 <li><a href="0500.htm">Standardfelder</a></li>
 <li><a href="../manual.htm">Heim</a></li>
</ul>
</div>
<div class="update">[2012-02-12]</div>
<div class="headpc"><img src="./pics/md5.png" alt="DatTools Logo" width="200" height="100" border="0" /></div>
</div>
<div class="crlf1"></div>
&#160;&#160;&#160;<a href="../manual.htm"><img src="./pics/nav_up.png" alt="aufw&auml;rts" width="20" height="20" border="0" title="aufw&auml;rts" /></a>
&#160;&#160;&#160;<a href="0001.htm"><img src="./pics/nav_bk.png" alt="zur&uuml;ck" width="20" height="20" border="0" title="zur&uuml;ck" /></a>
&#160;&#160;&#160;<a href="0101.htm"><img src="./pics/nav_fw.png" alt="vorw&auml;rts" width="20" height="20" border="0" title="vorw&auml;rts" /></a>
<div class="text100">
<h1>DatTools</h1>
- sind eine Sammlung von Werkzeugen zum Anlegen und Bearbeiten der Felder, die von ST-Open's Datenbankmaschine
 (DBE) verwaltet werden.
<div class="crlf1"></div>
- enthalten &Uuml;bersetzungsdialoge f&uuml;r mehrsprachige Programme. Bis zu 16 Sprachen werden von den in
 ST-Open's Bibliotheken bereitgestellten Funktionen (Men&uuml;- und Dialogtexte, Programmnachrichten, Hilfe)
 unterst&uuml;tzt. Die Umschaltung von einer Sprache auf die andere erfolgt selbstverst&auml;ndlich mit einem
 einfachen Klick im gerade laufendenden Programm.
<div class="crlf1"></div>
- bestehen zu 100 Prozent aus handoptimiertem Assemblercode. Sie sind daher wesentlich schlanker und weitaus
 schneller als ihre Vorg&auml;ngerversionen (Hybride aus Assembler und C).
<div class="crlf1"></div>
- entsprechen zu 100 Prozent den Regeln des <i>Intelligent Design</i>. Dank der Programmiertechnik des 21.
 Jahrhunderts werden Programme noch schlanker und erheblich schneller.
<div class="crlf2"></div>
<b>Hinweis 1:</b> Dieses 64 Bit Programm verwendet SSE2-Befehle. Ein entsprechender 64 Bit Prozessor und eine
 64 Bit Version von Windows sind zur Ausf&uuml;hrung zwingend erforderlich.
<div class="crlf2"></div>
<b>Hinweis 2:</b> <i>Intelligent Design</i> ist f&uuml;r Prozessoren mit drei oder mehr Ausf&uuml;hrungseinheiten
 pro Prozessorkern optimiert. Die maximale Geschwindigkeit von <i>Intelligent Design</i>-Programmen kann
 prinzipbedingt mit weniger ausgereiften Prozessoren (weniger als drei Ausf&uuml;hrungseinheiten pro Kern)
 nicht erreicht werden.
<div class="crlf2"></div>
<h2>Sprache</h2>
DatTools sind mehrsprachig. Jedes Sprachfeld unterst&uuml;tzen bis zu 16 verschiedene Sprachen, zwischen
 denen im laufenden Programm beliebig oft gewechselt werden kann. W&auml;hlen Sie hierzu im Men&uuml;
 <i>Programm</i> die Option <i>Sprache</i>, um die im Programm verf&uuml;gbaren Sprachen anzuzeigen:
<div class="crlf1"></div>
<div class="box100"><img src="./pics/mnu00.png" alt="Sprachauswahl" width="540" height="240" border="0"></div>
<div class="crlf1"></div>
W&auml;hlen Sie eine der angezeigten Sprachen. Alle Men&uuml;s, Dialoge, Nachrichten und Hilfetexte werden
 verz&ouml;gerungsfrei auf die gew&auml;hlte Sprache umgeschaltet. Offene Dialoge sind von der Sprachauswahl
 nicht betroffen. Sie m&uuml;ssen manuell geschlossen und wieder ge&ouml;ffnet werden, um in der neuen
 Sprache arbeiten zu k&ouml;nnen.
<div class="crlf1"></div>
<h2>Verschl&uuml;sselung</h2>
Verschl&uuml;sselte Datenfelder k&ouml;nnen nur dann bearbeitet werden, wenn das Sicherheitssystem (SecSys)
 aktiviert wurde.  W&auml;hlen Sie hierzu im Men&uuml; <i>Programm</i> die Option <i>SecSys Login</i>, um
 das Sicherheitssystem zu starten. Es ist sowohl der Meisterschl&uuml;ssel als auch PIN und Passwort eines
 Benutzers mit allen Zugriffsrechten erforderlich, um verschl&uuml;sselte Datenfelder zu editieren.
</div>
<div class="crlf2"></div>
&#160;&#160;&#160;<a href="../manual.htm"><img src="./pics/nav_up.png" alt="aufw&auml;rts" width="20" height="20" border="0" title="aufw&auml;rts" /></a>
&#160;&#160;&#160;<a href="0001.htm"><img src="./pics/nav_bk.png" alt="zur&uuml;ck" width="20" height="20" border="0" title="zur&uuml;ck" /></a>
&#160;&#160;&#160;<a href="0101.htm"><img src="./pics/nav_fw.png" alt="vorw&auml;rts" width="20" height="20" border="0" title="vorw&auml;rts" /></a>
<div class="crlf1"></div>
</body>
</html>
