<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de">
<head>
 <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
 <meta name="Page-topic" content="ST-Open's Weichwaren" />
 <meta name="Description" content="ST-Open's Weichwaren - Open Source Weichwaren f&uuml;r OS/2 und eCS" />
 <meta name="Keywords" content="ST-Open, software, open, source, weichware, bibliothek, frei, assembler, C" />
 <meta name="date" content="2009-05-08T00:00:00+00:00" />
 <meta name="robots" content="index,follow" />
 <meta name="revisit-after" content="14 days" />
 <meta name="generator" content="Bernhard Schornak, handwritten" />
 <style type="text/css"><!--@import "st.css";--></style>
 <link rel="SHORTCUT ICON" href="../pics/favicon.ico" />
 <title>ST-Open's Weichwaren</title>
</head>
<body id="top">
<div class="pagehd">
<div id="menu">
<ul>
 <li><a href="./st8/d/800.htm">Version 8.0.0.</a></li>
 <li><a href="./doc/d/index.htm">Dokumentation</a></li>
 <li><a href="indexe.htm">English</a></li>
 <li><a href="./doc/d/tut/FFFF.htm">Glossar</a></li>
</ul>
</div>
<div class="update">[2009-05-08]</div>
<div class="headpc"><img src="../pics/pgm.png" alt="ST-Software Logo" width="200" height="100" border="0" /></div>
</div>
<div class="crlf1"></div>
&#160;&#160;&#160;<img src="../pics/nav_up.png" alt="aufw&auml;rts" width="20" height="20" border="0" title="aufw&auml;rts" />
&#160;&#160;&#160;<a href="indexe.htm"><img src="../pics/nav_bk.png" alt="zur&uuml;ck" width="20" height="20" border="0" title="zur&uuml;ck" /></a>
&#160;&#160;&#160;<a href="indexe.htm"><img src="../pics/nav_fw.png" alt="vorw&auml;rts" width="20" height="20" border="0" title="vorw&auml;rts" /></a>
<div class="text100">
<h1>ST-Open Bibliotheken</h1>
<div class="crlf1"></div>
<h2>Version 8.0.0.</h2>
Version 8.0.0. der Bibliotheken ist ausschliesslich für Windows (64 Bit) entwickelt und erfordert
 zur Ausf&uuml;hrung der Programme zwingend eine 64 Bit Version von Windows. Da die Bibliotheken
 sich immer noch im Stadium der Portierung von OS/2 (eCS) nach Windows (64 Bit) befinden, ist die
 vorliegende Dokumentation nur eingeschr&auml;nkt g&uuml;ltig. Die auf Google bereitgestellten
 Quelldateien sind gr&ouml;sstenteils noch nicht getestet und werden daher als Betaversionen zur
 Verfügung gestellt. Da die Fertigstellung der Bibliotheken und Hilfsprogramme absoluten Vorrang
 hat, ist mit der Korrektur der HTML-Dokumentation erst nach Beendigung der vollst&auml;ndigen
 Portierung zu rechnen. Im Zweifelsfall sind ausschliesslich die im Quellcode angegebenen Ein- und
 Ausgabeparameter g&uuml;ltig.
<div class="crlf1"></div>
<h2>Was bietet ST-Open an?</h2>
<h3>Bibliotheken</h3>
Die Hauptbibliothek (Systembibliothek) enth&auml;lt ST-Open's Datenbankmaschine nebst einer eigenen
 Speicherverwaltung mit Bereitstellung von 896 statischen und 1024 Laufzeitvariablen (nat&uuml;rlich
 global verf&uuml;gbar), Datenumwandlungsfunktionen, Sandk&auml;sten f&uuml;r die am h&auml;ufigsten
 aufgerufenen API Funktionen, Unterst&uuml;tzung f&uuml;r eine vereinfachte Programmierung diverser
 PM-Kontrollelemente (z.B. Men&uuml;s, Listen- und Kombinationsk&auml;stchen, Drehkn&ouml;pfe, etc.),
 Zeichenkettenmanipulationen, Zeit- und schaltjahrbewusste Datumsfunktionen, sowie viele weitere
 n&uuml;tzliche Helferlein. Die Zusatzbibliotheken enthalten unter anderem ST-Open's Dateiliste, ein
 DBE-gesteuertes, einfach programmierbares Notizbuchskelett, Bitmapfunktionen via DBE und GPI, den
 Speicherhenkelmonitor, der die von der Speicherverwaltung belegten Speicherbl&ouml;cke anzeigt,
 einen simplen Registermonitor f&uuml;r Assemblerfanatiker, die multilinguale Onlinehilfe und SecSys,
 ST-Open's Sicherheitssystem, das Zugriffskontrolle &uuml;ber Men&uuml;s, Programmfunktionen und
 Datenfelder bietet. Die Verwaltung der durch SecSys gesch&uuml;tzten Felder, einschliesslich der
 Ver- und Entschl&uuml;sselung von Zeichenketten, ist, f&uuml;r den Benutzer vollst&auml;ndig
 transparent, in der Datenbankmaschine integriert.
<div class="crlf1"></div>
<h3>Programme</h3>
Die folgenden Programme werden momentan portiert:
<div class="crlf1"></div>
<a href="./st8/d/calc.htm" title="Rechner f&uuml;r Programmierer">Calc</a> - ein etwas anderer Rechner
 f&uuml;r Assemblerprogrammierer.
<div class="crlf1"></div>
<a href="./st8/d/hddrum.htm" title="Der Festplattentrommler">HDdrum</a> - Der Festplattentrommler.
 Spielt auch 7/4 und 9/8...
<div class="crlf1"></div>
<a href="./st8/d/hdrec.htm" title="Das Festplattenstudio">HDrec</a> - Das Festplattenstudio. Ein etwas
 anderer Ansatz zum Mischen von Tonquellen.
<div class="crlf1"></div>
<a href="./st8/d/md5.htm" title="MakeDat 5">MakeDat 5</a> - ST-Open's Werkzeugkasten f&uuml;r die
 Datenfelder der Datenbankmaschine. Enth&auml;lt alle Werkzeuge f&uuml;r die Erstellung und
 &Uuml;bersetzung multilingualer Men&uuml;s, Dialoge, Hilfetexte und Systemnachrichten.
<div class="crlf1"></div>
<a href="./st8/d/sre.htm" title="Der Suchen- und Ersetzen-Editor">SRE</a> - Der etwas andere Editor.
 Mit bis zu 32 gleichzeitig geladenen Dateien. Teilt grosse Dateien (bis zu 4 GB) in verarbeitbare
 St&uuml;cke auf und setzt die berbeiteten Teile auch wieder zusammen. Wandelt Bin&auml;rdateien auf
 Wunsch in editierbare Hexdumps um und speichert editierte Dumps auf Wunsch auch wieder als
 Bin&auml;rdateien. Bietet in der simplen Suchfunktion im Editor 32 permanent gespeicherte Suchen- /
 Ersetzenpaare, wobei die Ersetzenzeichenketten auch mehrzeilig sein d&uuml;rfen (Zeilenumbr&uuml;che
 werden von der Suchfunktion des MLE als Ende der Zeichenkette behandelt). Bietet die einmalige
 Erweiterung einer globalen Suche mit 32 Suchen- und Ersetzenpaare in bis zu 256 Verzeichnissen mit
 maximal 16384 Dateien - alle gefundenen Unterverzeichnisse werden automatisch in die Suche mit
 einbezogen. Als zus&auml;tzliche Werkzeuge gibt es eine Liste mit bis zu 256 Textbausteinen, die
 wahlfrei an den Anfang, das Ende oder die aktuelle Zeigerposition kopiert werden k&ouml;nnen, ein
 kleines, 256-seitiges Nachschlagewerk mit <i>Spickzetteln</i>, zum Beispiel zum kurzen Nachschauen,
 wie eine h&auml;ufig verwendete Struktur zusammengesetzt ist, ein momentan noch rudiment&auml;res
 Werkzeug zur Verwaltung von HTML-Seiten sowie einen Konverter, der die von GCC erzeugten
 <b>.s</b>-Dateien anst&auml;ndig formatiert und die unerw&uuml;nschte Umwandlung hexadezimaler in
 dezimale Zahlen r&uuml;ckg&auml;ngig macht.
<div class="crlf1"></div>
<a href="./st8/d/v8s.htm" title="V800 Programmskelett">V800 Programmskelett</a> - ST-Open's "Schablone"
 f&uuml;r <i>Ihr</i> neues Programm. Enth&auml;lt alles, was man als Programmierer so zum Loslegen
 braucht. Nur die Beispiele m&uuml;ssen Sie noch durch Ihren Code ersetzen... ;)
<div class="crlf1"></div>
<h2>In eigener Sache...</h2>
Bitte beachten Sie, dass ausschliesslich die aktuelle Version 8.0.0. und die in der V800-Distribution
 enthaltenen Programme weiterentwickelt und unterst&uuml;tzt werden - ich arbeite bereits zwischen 18
 und 24 Stunden t&auml;glich an der Weiterentwicklung der Bibliotheken, der Pflege meiner aktuellen
 Programme, der Pflege dieser Heimatseite und allen m&ouml;glichen anderen Dingen. Wenn jemand meint,
 etwas verbessern zu k&ouml;nnen: Tun Sie es einfach! Beachten Sie jedoch, dass auch Derivate meiner
 Quelltexte unter dem Schutz der
 <a href="http://ft4fp.blogspot.com/p/die-ft4fp-lizenz.html">FT4FP-Lizenz</a> stehen. Diese besagt
 unter anderem, dass die Empf&auml;nger weder f&uuml;r Kopien des Originals noch f&uuml;r die Kopien
 von Derivaten des Originals etwas bezahlen d&uuml;rfen.
</div>
<div class="crlf2"></div>
&#160;&#160;&#160;<img src="../pics/nav_up.png" alt="aufw&auml;rts" width="20" height="20" border="0" title="aufw&auml;rts" />
&#160;&#160;&#160;<a href="indexe.htm"><img src="../pics/nav_bk.png" alt="zur&uuml;ck" width="20" height="20" border="0" title="zur&uuml;ck" /></a>
&#160;&#160;&#160;<a href="indexe.htm"><img src="../pics/nav_fw.png" alt="vorw&auml;rts" width="20" height="20" border="0" title="vorw&auml;rts" /></a>
<div class="crlf1"></div>
</body>
</html>
